app/controllers/sessions_controller.rb

  def create
    user = User.authenticate(params[:email], [:password])

    if user.present?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "agent555"], ["LIMIT", 1]]