app/controllers/users_controller.rb

  def create
    redirect_to root_url, alert: 'Вы уже залогинены' if current_user.present?
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "username", "created_at", "updated_at", "email", "password_hash", "password_salt") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @questions = @user.questions.order(created_ad: :desc)
---
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ? ORDER BY "created_ad" DESC  [["user_id", 19]]

  def load_user
    @user ||= User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]