app/models/user.rb

  def self.authenticate(email, password)
    user = find_by(email: email)
    if user.present? && user.password_hash == User.hash_to_string(OpenSSL::PKCS5.pbkdf2_hmac(password, user.password_salt, ITERATIONS, DIGEST.length, DIGEST))
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alex12@ya.ru"], ["LIMIT", 1]]